"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""


data = [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]




def main(data, total = 0, total_sales = 0, mean_sales = 0): 
    
    for i in data:
      for j in i['items_sold']:
        total += j
      mean = total/len(i['items_sold'])
      print('Суммарное количество продаж '+ i['product'] + ':\t' + str(total))
      print('Cреднее количество продаж '+ i['product'] + ':\t' + str('%.2f' % mean + '\n'))
      total_sales += total
      total = 0
      mean_sales += mean
      total = 0
    print('Суммарное количество продаж всех товаров:\t', total_sales)
    print('Cреднее количество продаж всех товаров:\t', mean_sales/len(data))




    pass
    
if __name__ == "__main__":
    main(data)
